acaballero/etherlab/lib/ST77XX-STM32/Display_afb.cpp
            if (this->curr_buffer == b565_buffer) {

                // The first half of the RGB buffer is ready to be transferred
                // If DMA is ready (second half has been transferred, so state == READY), we start another transfer now

                this->curr_buffer = b565_buffer + half_dma_buffer_size;

                if (this->use_dma) {
                    // GPIOD->BSRR |= GPIO_PIN_5;
                    while (HAL_SPI_GetState(spi_port) != HAL_SPI_STATE_READY) {
                        ;
                    }
                    // GPIOD->BSRR |= GPIO_PIN_5<<16;
                    this->DMAHalfTransferCompleted = false;
                    HAL_SPI_Transmit_DMA(spi_port, ((uint8_t *)b565_buffer), dma_transfer_length);
                }
            } else {

                // The second half of the RGB buffer is ready
                // Wait for the first half of the buffer to be transferred before start again

                this->curr_buffer = b565_buffer;

                if (this->use_dma) {
                    while (!this->DMAHalfTransferCompleted) {
                        ;
                    }
                }

                // The last chunk may need fewer bytes to transfer
                if (area->box.height - this->current_line < this->chunk_height << 1) {
                    dma_buffer_size = (area->box.height - this->current_line) * area->box.width;
                    dma_transfer_length = dma_buffer_size << 1;
                }
            }
        }

        if (this->use_dma) {
            while (HAL_SPI_GetState(spi_port) != HAL_SPI_STATE_READY) {
                ;
            }
            EndDisplayDataTransfer();
        } else {
            DISP_DC_PORT->BSRR |= DISP_DC_PIN << 16; // DC PIN UNSET
        }

        this->drawing = false;
    }
}

// Function to draw a single corner using midpoint circle algorithm
void Display::drawCorner(uint16_t centerX, uint16_t centerY, uint8_t radius, uint8_t quadrant, bool filled) {

    int x = 0;
    int y = radius;
    int d = 3 - 2 * radius;

    while (y >= x) {
        if (filled) {
            switch (quadrant) {
                case 1: // Top-right
                    writeLine(centerX, centerY - y, centerX + x, centerY - y);
                    writeLine(centerX, centerY - x, centerX + y, centerY - x);
                    break;
                case 2: // Top-left
                    writeLine(centerX - x, centerY - y, centerX, centerY - y);
                    writeLine(centerX - y, centerY - x, centerX, centerY - x);
                    break;
                case 3: // Bottom-left
                    writeLine(centerX - x, centerY + y, centerX, centerY + y);
                    writeLine(centerX - y, centerY + x, centerX, centerY + x);
                    break;
                case 4: // Bottom-right
                    writeLine(centerX, centerY + y, centerX + x, centerY + y);
                    writeLine(centerX, centerY + x, centerX + y, centerY + x);
                    break;
            }
        } else {
            switch (quadrant) {
                case 1: // Top-right
                    setPixel(centerX + x, centerY - y, color);
                    setPixel(centerX + y, centerY - x, color);
                    break;
                case 2: // Top-left
                    setPixel(centerX - x, centerY - y, color);
                    setPixel(centerX - y, centerY - x, color);
                    break;
                case 3: // Bottom-left
                    setPixel(centerX - x, centerY + y, color);
                    setPixel(centerX - y, centerY + x, color);
                    break;
                case 4: // Bottom-right
                    setPixel(centerX + x, centerY + y, color);
                    setPixel(centerX + y, centerY + x, color);
                    break;
            }
        }

        if (d < 0) {
            d += 4 * x + 6;
        } else {
            d += 4 * (x - y) + 10;
            y--;
        }
        x++;
    }
}

void Display::drawRoundedRectangle(uint16_t x0, uint16_t y0, uint16_t width, uint16_t height, uint16_t radius, bool filled) {
    drawRoundedRectangle(x0, y0, width, height, radius, filled, true, true, true, true);
}

void Display::drawRoundedRectangle(uint16_t x0, uint16_t y0, uint16_t width, uint16_t height, uint16_t radius, bool filled, bool top_left, bool top_right,
                                   bool bottom_left, bool bottom_right) {

    int x1 = x0 + radius, y1 = y0 + radius;
    int x2 = x0 + width - radius, y2 = y0 + height - radius;

    // Draw the rectangular body without corners
    if (filled) {
        for (int y = 0; y < height; y++) {
            int startX = ((top_left && y < radius) || (bottom_left && y >= height - radius)) ? radius : 0;
            int endX = ((top_right && y < radius) || (bottom_right && y >= height - radius)) ? width - radius : width;
            writeLine(x0 + startX, y0 + y, x0 + endX - 1, y0 + y);
        }
    } else {
        // Draw the straight lines for the sides and top/bottom
        writeLine(x1, y0, x2, y0);                           // Top
        writeLine(x1, y0 + height - 1, x2, y0 + height - 1); // Bottom
        writeLine(x0, y1, x0, y2);                           // Left
        writeLine(x0 + width - 1, y1, x0 + width - 1, y2);   // Right
    }
    // Draw the four cornerscd
    if (top_right) {
        drawCorner(x0 + width - radius - 1, y0 + radius, radius, 1, filled); // Top-right
    }
    if (top_left) {
        drawCorner(x0 + radius, y0 + radius, radius, 2, filled); // Top-left
    }
    if (bottom_left) {
        drawCorner(x0 + radius, y0 + height - radius - 1, radius, 3, filled); // Bottom-left
    }
    if (bottom_right) {
        drawCorner(x0 + width - radius - 1, y0 + height - radius - 1, radius, 4, filled); // Bottom-right
    }
}

void Display::DMATxHalfCpltCallback(void) {
    this->DMAHalfTransferCompleted = true;
    // GPIOB->BSRR= GPIO_PIN_5 << 16;
}

void Display::DMATxCpltCallback(void) {}

